# Classification - Acquire Exercises

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from pydataset import data
import acquire as a

#### 1.  In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
iris = data("iris")

In [3]:
#print the first three rows:
iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
#print the number of rows and columns (shape)
iris.shape

(150, 5)

In [5]:
#print the column names:
iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [6]:
#print the data type of each column
iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [7]:
#more detailed look
iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

#### print the summary statistics for each of the numeric variables. 
Would you recommend rescaling the data based on these statistics?

In [8]:
#summary statistics
stats = iris.describe().T
stats

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

#### I would not recommend rescaling because they are all measured in cm.

### 2. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [9]:
df_excel = pd.read_excel('Spreadsheets_Exercises.xlsx', sheet_name='Table1_CustDetails')
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,Unnamed: 12,Unnamed: 13
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,NaN,NaN
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,NaN,NaN
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,NaN,NaN
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,NaN,NaN
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,NaN,NaN

In [10]:
#assign the first 100 rows to a new df df_excel_sample
df_excel_sample = df_excel.head(100)
df_excel_sample.shape

(100, 14)

In [11]:
#print the number of rows of your original dataframe
df_excel.shape[0]

7049

In [12]:
#print the first 5 column names
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [13]:
#print the column names that have a data type of object
object_columns = df_excel.select_dtypes(include='object')
object_columns.columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [14]:
#compute range of numeric values

#create df with just numeric values and describe with stats to show min and max
numeric_df = df_excel[['monthly_charges', 'total_charges']].describe().T

In [18]:
#use stats and use min and max to add new column with range
numeric_df['range'] = numeric_df['max'] - numeric_df['min']

In [23]:
#show only range column
numeric_df['range']

monthly_charges     100.5
total_charges      8666.0
Name: range, dtype: float64

### 3.  Read the data from this google sheet into a dataframe, df_google

In [26]:
#create variable with URL
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

In [27]:
#export to csv using .replace
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [29]:
#create df
df_google = pd.read_csv(csv_export_url)
df_google.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
# print first 3 rows
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [31]:
#print the number of rows and columns
df_google.shape

(891, 12)

In [35]:
df_google.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [36]:
#print the data type of each column
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [34]:
#print summary statistics
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [37]:
#print the unique values for each of your categoricals
for column in df_google.select_dtypes(include='object').columns:
    print(df_google[column].value_counts())

Hays, Miss. Margaret Bechstein                              1
Sjoblom, Miss. Anna Sofia                                   1
Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)       1
McCoy, Mr. Bernard                                          1
Sage, Master. Thomas Henry                                  1
                                                           ..
Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)    1
Webber, Miss. Susan                                         1
Skoog, Miss. Margit Elizabeth                               1
Futrelle, Mr. Jacques Heath                                 1
Dahl, Mr. Karl Edwart                                       1
Name: Name, Length: 891, dtype: int64
male      577
female    314
Name: Sex, dtype: int64
347082      7
CA. 2343    7
1601        7
3101295     6
CA 2144     6
           ..
A/5. 851    1
312992      1
C 17369     1
11769       1
226593      1
Name: Ticket, Length: 681, dtype: int64
B96 B98            4
G6                 4
C23 C25 C27        4
C22 C26            3
F33                3
E101               3
F2                 3
D                  3
B51 B53 B55        2
C123               2
B58 B60            2
E24                2
E121               2
B18                2
E8                 2
D35                2
C83                2
B5                 2
E33                2
C78                2
C68                2
C2                 2
B22                2
C92                2
D20                2
C126               2
C52                2
F4                 2
D17                2
B57 B59 B63 B66    2
C125               2
B35                2
B49                2
C93                2
B28                2
F G73              2
B20                2
C65                2
E25                2
E67                2
D26                2
B77                2
D36                2
C124               2
E44                2
D33                2
B37                1
C110               1
A26                1
D6                 1
D49                1
B86                1
B39                1
D9                 1
D21                1
B80                1
E58                1
C62 C64            1
E31                1
E17                1
A23                1
D7                 1
D48                1
D56                1
E68                1
E63                1
A36                1
C99                1
C46                1
E34                1
C103               1
D46                1
T                  1
E38                1
C82                1
C50                1
D47                1
A32                1
B79                1
E40                1
D10 D12            1
D37                1
B82 B84            1
D11                1
C90                1
D45                1
A5                 1
B94                1
E50                1
C111               1
C95                1
E12                1
B38                1
B30                1
B19                1
A14                1
C7                 1
B41                1
F38                1
B42                1
B102               1
E46                1
A24                1
D28                1
C118               1
B101               1
C128               1
D50                1
A16                1
E77                1
C54                1
E10                1
C87                1
B69                1
F G63              1
A7                 1
C32                1
C85                1
E36                1
A10                1
C47                1
B4                 1
B50                1
B73                1
E49                1
D19                1
C86                1
A20                1
C104               1
C148               1
B3                 1
A19                1
F E69              1
B78                1
D15                1
C91                1
C45                1
C49                1
C101               1
C30                1
A34                1
B71                1
A31                1
C106               1
A6                 1
D30                1
C70                1
Name: Cabin, dtype: int64
S    644
C    168
Q     77
Name: Embarked, dtype: int64

# Prepare Exercises

In [ ]:
#rename
df = def.rename(columns={'species_name':'species'})
df.head

In [ ]:
#create dummy variables
dummy_df = pd.get_dummies(df['species'], drop_first=False)
dummy_df.head()

In [ ]:
#join with original dataframe
df = pd.concat([df, dummy_df], axis=1)
df.head()

In [ ]:
##### create a function named prep_iris

In [ ]:
def prep_iris

In [ ]:
prep_iris(df).head()